In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("Online Retail.xlsx")
df.shape

(541909, 8)

In [4]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [15]:
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [39]:
df[df['CustomerID'].isnull()]
# Here we see that there are null values only in the CustomerID column. Whereever there is null in Description, that has no CustomerID.

Empty DataFrame
Columns: [InvoiceNo, StockCode, Description, Quantity, InvoiceDate, UnitPrice, CustomerID, Country]
Index: []

In [32]:
df[df.isnull().any(axis=1)]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.00,NaN,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,2010-12-01 14:32:00,2.51,NaN,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,2010-12-01 14:32:00,2.51,NaN,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,2010-12-01 14:32:00,0.85,NaN,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,2010-12-01 14:32:00,1.66,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
541536,581498,85099B,JUMBO BAG RED RETROSPOT,5,2011-12-09 10:26:00,4.13,NaN,United Kingdom
541537,581498,85099C,JUMBO BAG BAROQUE BLACK WHITE,4,2011-12-09 10:26:00,4.13,NaN,United Kingdom
541538,581498,85150,LADIES & GENTLEMEN METAL SIGN,1,2011-12-09 10:26:00,4.96,NaN,United Kingdom
541539,581498,85174,S/4 CACTI CANDLES,1,2011-12-09 10:26:00,10.79,NaN,United Kingdom
541540,581498,DOT,DOTCOM POSTAGE,1,2011-12-09 10:26:00,1714.17,NaN,United Kingdom

In [40]:
df.dropna(inplace=True)

In [41]:
df.shape

(406829, 8)

In [42]:
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [46]:
df[df.duplicated()]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
517,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom
527,536409,22866,HAND WARMER SCOTTY DOG DESIGN,1,2010-12-01 11:45:00,2.10,17908.0,United Kingdom
537,536409,22900,SET 2 TEA TOWELS I LOVE LONDON,1,2010-12-01 11:45:00,2.95,17908.0,United Kingdom
539,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom
555,536412,22327,ROUND SNACK BOXES SET OF 4 SKULLS,1,2010-12-01 11:49:00,2.95,17920.0,United Kingdom
...,...,...,...,...,...,...,...,...
541675,581538,22068,BLACK PIRATE TREASURE CHEST,1,2011-12-09 11:34:00,0.39,14446.0,United Kingdom
541689,581538,23318,BOX OF 6 MINI VINTAGE CRACKERS,1,2011-12-09 11:34:00,2.49,14446.0,United Kingdom
541692,581538,22992,REVOLVER WOODEN RULER,1,2011-12-09 11:34:00,1.95,14446.0,United Kingdom
541699,581538,22694,WICKER STAR,1,2011-12-09 11:34:00,2.10,14446.0,United Kingdom
541701,581538,23343,JUMBO BAG VINTAGE CHRISTMAS,1,2011-12-09 11:34:00,2.08,14446.0,United Kingdom

In [49]:
df.drop_duplicates(inplace=True)

In [50]:
df.shape

(401604, 8)

In [ ]:
# Countrywise Sales
df.groupby(df['Country'])['UnitPrice'].sum()

Country
Australia                  4048.000
Austria                    1701.520
Bahrain                      78.950
Belgium                    7540.130
Brazil                      142.600
Canada                      910.580
Channel Islands            3736.900
Cyprus                     3880.040
Czech Republic               88.150
Denmark                    1266.950
EIRE                      38209.260
European Community          294.050
Finland                    3786.850
France                    42825.230
Germany                   37633.440
Greece                      713.290
Iceland                     481.210
Israel                      906.650
Italy                      3879.390
Japan                       814.860
Lebanon                     242.440
Lithuania                    99.440
Malta                       666.010
Netherlands                6492.550
Norway                     6529.060
Poland                     1422.270
Portugal                  12903.250
RSA                         248.100
Saudi Arabia                 24.110
Singapore                 25108.890
Spain                     12621.500
Sweden                     1804.730
Switzerland                6568.600
USA                         644.980
United Arab Emirates        229.890
United Kingdom          1165878.034
Unspecified                 775.950
Name: UnitPrice, dtype: float64

In [ ]:
# Country that gave most sales
df.groupby(df['Country'])['UnitPrice'].sum().sort_values(ascending=False).head(1).reset_index()

          Country    UnitPrice
0  United Kingdom  1165878.034

In [63]:
# Country that gave Least sales
df.groupby(df['Country'])['UnitPrice'].sum().sort_values(ascending=True).head(1).reset_index()

        Country  UnitPrice
0  Saudi Arabia      24.11

In [ ]:
# Top 15 customers by Purchases
df.groupby(df['CustomerID'])['UnitPrice'].sum().sort_values(ascending=False).head(15).reset_index()

    CustomerID  UnitPrice
0      14096.0   41376.33
1      15098.0   40278.90
2      14911.0   31025.29
3      12744.0   25108.89
4      16029.0   24101.56
5      17841.0   19956.37
6      12748.0   14698.31
7      12536.0   13255.22
8      12757.0    8012.79
9      15502.0    7836.84
10     14606.0    7778.46
11     14156.0    6535.34
12     15311.0    6245.10
13     14527.0    5994.95
14     14646.0    5400.21

In [70]:
df.groupby(['CustomerID', 'Country'])['UnitPrice'] \
  .sum() \
  .sort_values(ascending=False) \
  .head(15) \
  .reset_index()

    CustomerID         Country  UnitPrice
0      14096.0  United Kingdom   41376.33
1      15098.0  United Kingdom   40278.90
2      14911.0            EIRE   31025.29
3      12744.0       Singapore   25108.89
4      16029.0  United Kingdom   24101.56
5      17841.0  United Kingdom   19956.37
6      12748.0  United Kingdom   14698.31
7      12536.0          France   13255.22
8      12757.0        Portugal    8012.79
9      15502.0  United Kingdom    7836.84
10     14606.0  United Kingdom    7778.46
11     14156.0            EIRE    6535.34
12     15311.0  United Kingdom    6245.10
13     14527.0  United Kingdom    5994.95
14     14646.0     Netherlands    5400.21

In [ ]:
# Country wise highest total spend
df.groupby(['Country', 'CustomerID'])['UnitPrice'].sum() \
  .reset_index() \
  .sort_values(['Country', 'UnitPrice'], ascending=[True, False]) \
  .groupby('Country') \
  .head(1)

                   Country  CustomerID  UnitPrice
3                Australia     12415.0    2499.82
10                 Austria     12360.0     457.91
21                 Bahrain     12355.0      54.65
23                 Belgium     12362.0    1083.29
47                  Brazil     12769.0     142.60
50                  Canada     17444.0     883.90
59         Channel Islands     14936.0    1358.79
61                  Cyprus     12359.0    2210.06
69          Czech Republic     12781.0      88.15
74                 Denmark     12406.0     305.99
81                    EIRE     14911.0   31025.29
82      European Community     15108.0     294.05
86                 Finland     12428.0    1418.79
111                 France     12536.0   13255.22
187                Germany     12473.0    2437.42
278                 Greece     12717.0     306.85
281                Iceland     12347.0     481.21
285                 Israel     12688.0     705.33
292                  Italy     12584.0     938.10
301                  Japan     12753.0     536.39
309                Lebanon     12764.0     242.44
310              Lithuania     15332.0      99.44
312                  Malta     17828.0     474.14
321            Netherlands     14646.0    5400.21
323                 Norway     12352.0    2211.10
334                 Poland     12779.0     586.61
340               Portugal     12757.0    8012.79
357                    RSA     12446.0     248.10
358           Saudi Arabia     12565.0      24.11
359              Singapore     12744.0   25108.89
376                  Spain     12539.0    2856.04
391                 Sweden     12483.0     484.21
409            Switzerland     12451.0     868.18
421                    USA     12607.0     435.86
424   United Arab Emirates     12739.0     152.32
1335        United Kingdom     14096.0   41376.33
4377           Unspecified     12743.0     402.12

In [73]:
# Country wise most purchases
df.groupby(['Country', 'CustomerID']) \
  .size() \
  .reset_index(name='Purchases') \
  .sort_values(['Country', 'Purchases'], ascending=[True, False]) \
  .groupby('Country') \
  .head(1)

                   Country  CustomerID  Purchases
3                Australia     12415.0        778
10                 Austria     12360.0        129
21                 Bahrain     12355.0         13
23                 Belgium     12362.0        274
47                  Brazil     12769.0         32
50                  Canada     17444.0        135
59         Channel Islands     14936.0        366
61                  Cyprus     12359.0        251
69          Czech Republic     12781.0         30
74                 Denmark     12406.0        108
81                    EIRE     14911.0       5898
82      European Community     15108.0         61
86                 Finland     12428.0        300
150                 France     12681.0        646
185                Germany     12471.0        530
278                 Greece     12717.0         56
281                Iceland     12347.0        182
285                 Israel     12688.0        171
292                  Italy     12584.0        126
301                  Japan     12753.0        230
309                Lebanon     12764.0         45
310              Lithuania     15332.0         35
312                  Malta     17828.0         82
321            Netherlands     14646.0       2085
327                 Norway     12433.0        420
334                 Poland     12779.0        159
340               Portugal     12757.0        370
357                    RSA     12446.0         58
358           Saudi Arabia     12565.0         10
359              Singapore     12744.0        229
377                  Spain     12540.0        481
398                 Sweden     17404.0        201
409            Switzerland     12451.0        355
421                    USA     12607.0        202
424   United Arab Emirates     12739.0         38
4047        United Kingdom     17841.0       7812
4377           Unspecified     12743.0        131